# encoding:utf-8
'''
@author: Yawen Tan
@project: Expressway
@file: Head_Crawl_Data.py
@time: 2024/3/6 20:13
@desc:
'''
import json
import requests
from tqdm import tqdm
import pandas as pd
import json
from Expressway.Tool.Buffer import SaveLoad


def find_pos(place_list):
    '''

    :param place_list: ['place name']
    :return: {'place name':'经度,纬度'}
    '''

    #place = input("请输入您要查询的地址")
    pos = {}
    for place in place_list:
        url = 'https://restapi.amap.com/v3/geocode/geo?parameters'
        parameters = {
            'key': 'c1bd97fcb26991908307bceb422876cd',
            'address': '%s' % place
        }
        page_resource = requests.get(url, params=parameters)
        text = page_resource.text  # 获得数据是json格式
        data = json.loads(text)  # 把数据变成字典格式
        location = data["geocodes"][0]['location']

        pos[place] = location
   # print(location)
    return pos


def get_distance(origin_dict, destination_dict):
    '''
    :param origin_dict: 起点的字典
    :param destination_dict:终点的字典
    :return: {‘起点1’，‘起点’：‘距离’}
    '''

    url = "https://restapi.amap.com/v3/direction/driving"
    pos_dict = {}

    for name_1, pos_1 in tqdm(origin_dict.items(), desc='Getting distance information', unit="s"):
        for name_2, pos_2 in destination_dict.items():
            print(f"Calculating distance from {name_1} to {name_2}...")
            params = {
                "origin": pos_1,  # 起点坐标
                "destination": pos_2,  # 终点坐标
                "key": 'c1bd97fcb26991908307bceb422876cd'  # 高德地图API Key
            }

            response = requests.get(url, params=params)
            data = response.json()

            if data["status"] == "1":
                distance = int(data["route"]["paths"][0]["distance"])
                pos_dict[(name_1, name_2)] = distance
            else:
                print(f"Error: Unable to calculate distance for {name_1} to {name_2}. API status: {data['status']}")

    return pos_dict


def reverse_geocode_pois(location,radius):
    '''
    :param location: '经度，纬度'
    :param radius: 搜索半径
    :return: 搜索半径内的所有高速收费站
    '''

    url = "https://restapi.amap.com/v3/geocode/regeo"

    params = {
        "key": 'c1bd97fcb26991908307bceb422876cd',
        "location": location,
        "poitype": '高速公路|高速',#'道路附属设施|收费站|高速收费站'
        "radius": radius,
        "extensions": 'all',
        "roadlevel": '0'
    }

    response = requests.get(url, params=params)
    data = response.json()

    if data["status"] == "1":
        pois = data["regeocode"]["pois"]
        poi_names = [poi["name"] for poi in pois]
        return poi_names
    else:
        return ["逆地理编码失败"]




def deal_pos(pos_dict):
    # 将格式输入的高速数据点改为可搜索距离格式
    updated_pos_dict = {}  # 创建一个新的字典，用于存储更新后的位置数据
    for node, pos in pos_dict.items():
        pos = str(pos).replace('(', '')
        pos = str(pos).replace(')', '')
        pos = str(pos).replace(' ', '')
        updated_pos_dict[node] = pos  # 更新位置数据，并添加到新的字典中
    return updated_pos_dict



def get_driving_route(start_coord_str, end_coord_str):

    key = 'c1bd97fcb26991908307bceb422876cd'
    start_lng, start_lat = map(float, start_coord_str.split(','))
    end_lng, end_lat = map(float, end_coord_str.split(','))
    url = f'https://restapi.amap.com/v3/direction/driving?origin={start_lng},{start_lat}&destination={end_lng},{end_lat}&key={key}'
    response = requests.get(url)
    data = response.json()
    if data['status'] == '1':
        route_list = []
        steps = data['route']['paths'][0]['steps']
        for step in steps:
            if 'road' in step:
                route_list.append(step['road'])
        return route_list
    else:
        print("Error:", data['info'])
        return None


import requests


def convert_coordinates_to_amap(coordinates_dict):
    """
    将坐标字符串从EPSG:4326转换为高德坐标系（autonavi）。

    参数:
    - coordinates_dict: 包含经纬度字符串的字典，格式为{"坐标1": "经度,纬度", "坐标2": "经度,纬度", ...}

    返回:
    - 键不变，值为转换后坐标的字典。
    """
    # 构建locations参数
    coordinates_list = list(coordinates_dict.values())
    locations = '|'.join(coordinates_list)

    # 构建API请求URL
    url = "https://restapi.amap.com/v3/assistant/coordinate/convert"
    params = {
        "locations": locations,
        "coordsys": "gps",
        "output": "json",
        "key": 'c1bd97fcb26991908307bceb422876cd'  # 请替换为您的高德地图API密钥
    }

    # 发送GET请求到高德地图API
    response = requests.get(url, params=params)

    # 解析响应
    if response.status_code == 200:
        data = response.json()
        if data['status'] == '1':  # 检查请求是否成功
            converted_locations = data['locations'].split(';')
            # 构建转换后的坐标字典
            result_dict = {}
            for i in range(len(coordinates_list)):
                result_dict[list(coordinates_dict.keys())[i]] = converted_locations[i]
            return result_dict
        else:
            print("错误:", data['info'])
    else:
        print("错误:", response.status_code)



def clean_data(radius):
    class_SaveLoad = SaveLoad

    need_dict = class_SaveLoad.load_pos(class_SaveLoad,'E:/Expressway/.Host file_2/','pos_data')

    name = []

    for code,pos in tqdm(need_dict.items()):
        if len(reverse_geocode_pois(pos,radius)) == 0:
            #print(reverse_geocode_pois(pos,radius))
            name.append(code)
    for i in name:
        #print(i)
        del need_dict[i]
    return need_dict

def test_expressway(edge_data):
    class_SaveLoad = SaveLoad
    delt_pos = class_SaveLoad.load_pos(class_SaveLoad,'E:/Expressway/.Host file_2/','pos_data')
    edge_to_del = []

    for edge in tqdm(edge_data):
        if edge is not None:
            driving_route = get_driving_route(delt_pos[edge[0]], delt_pos[edge[1]])
            #print(driving_route)
            if driving_route is not None:
                found_expressway = False
                for i in driving_route:
                    if '高速' in i:
                        found_expressway = True
                        break
                if not found_expressway:
                    edge_to_del.append(edge)
            else:
                print(f"Warning: No driving route found for edge {edge}")

    return edge_to_del














# 示例使用{'G0075500040040': '106.69329, 28.943389',
#print(Position_1.node_pos)


#df = pd.read_excel('output.xlsx')

# 获取列数据
#inital_data = df['inital']
#pos = [i.replace(' ','') for i in inital_data]
#print(pos)

#a = [reverse_geocode_pois(i) for i in pos]
#list = [['雷神店收费站(G75兰海高速入口西北向)', '雷神店收费站(G75兰海高速出口三江方向)', '雷神店收费站(G75兰海高速出口三江方向)', '雷神店收费站(G75兰海高速入口东南向)'], ['万盛西收费站(S0101綦万高速入口)', '万盛西收费站(S0101綦万高速出口)'], ['周嘉收费站(G42沪蓉高速出口)', '周嘉收费站(G42沪蓉高速入口)'], ['雅江收费站(G65包茂高速出口)', '雅江收费站(G65包茂高速入口)'], [], ['田家收费站(G93成渝环线高速入口)', '田家收费站(G93成渝环线高速出口)'], [], ['三教收费站(G8515广泸高速入口)', '三教收费站(G8515广泸高速出口)'], ['新立收费站(G50沪渝高速入口)', '新立收费站(G50沪渝高速出口)'], ['安稳北收费站(G7521渝筑高速出口)', '安稳北收费站(G7521渝筑高速入口)', '安稳收费站(G75兰海高速出口)', '安稳收费站(G75兰海高速入口)'], [], ['麻柳嘴收费站(G5021石渝高速出口)', '麻柳嘴收费站', '麻柳嘴收费站(G5021石渝高速入口)'], ['高家镇收费站(G69银百高速出口)', '高家镇收费站(G69银百高速入口)'], ['洋渡收费站(G69银百高速出口)', '洋渡收费站(G69银百高速入口)'], ['西沱收费站(G69银百高速出口)', '西沱收费站(G69银百高速入口)'], ['三泉收费站(G69银百高速出口)', '三泉收费站(G69银百高速入口)'], [], ['西湖收费站(S0101江綦高速出口)', '西湖收费站(S0101江綦高速入口)'], ['合川收费站(G75兰海高速出口南充方向)', '合川收费站(G75兰海高速入口东南向)', '合川收费站(G75兰海高速出口)', '合川收费站(G75兰海高速入口)'], ['袁驿收费站(G5515张南高速出口)', '袁驿收费站(G5515张南高速入口)'], ['钱塘收费站(G75兰海高速入口)', '钱塘收费站(G75兰海高速出口)'], ['晏家收费站(G50沪渝高速入口)', '晏家收费站(G50沪渝高速出口)'], ['万古收费站(G8515广泸高速入口)', '万古收费站(G8515广泸高速出口)'], ['民国场收费站(G69银百高速出口)', '民国场收费站(G69银百高速入口)'], [], ['大足收费站(G5013渝蓉高速出口)', '大足收费站(G5013渝蓉高速入口)'], [], ['东阳收费站(G75兰海高速入口)', '东阳收费站(G75兰海高速出口)'], ['草街收费站(G75兰海高速出口)', '草街收费站(G75兰海高速入口)', '收费站(渝武高速复线出口)', '收费站(渝武高速复线入口)'], ['丰盛收费站(G5021石渝高速入口)', '丰盛收费站(G5021石渝高速出口)'], ['永川西收费站(S0101三环高速入口)', '永川西收费站(S0101三环高速出口)'], [], ['南川收费站(G65包茂高速入口)', '南川收费站(G65包茂高速出口)'], ['红狮收费站(G42沪蓉高速入口)', '红狮收费站(G42沪蓉高速出口)'], ['巫溪收费站(G6911安来高速出口)', '巫溪收费站(G6911安来高速入口)'], ['北渡收费站(S0101江綦高速出口)', '北渡收费站(S0101江綦高速入口)'], ['东溪收费站(G75兰海高速入口)', '东溪收费站(G75兰海高速出口)'], ['綦江收费站(G75兰海高速出口)', '綦江收费站(G75兰海高速入口)'], ['大庙收费站(G5013渝蓉高速入口)', '大庙收费站(G5013渝蓉高速出口)'], ['马武收费站(G69银百高速入口)', '马武收费站(G69银百高速出口)'], ['黔江南收费站(G65包茂高速入口)', '黔江南收费站(G65包茂高速出口)'], ['草堂收费站(G42沪蓉高速入口)', '草堂收费站(G42沪蓉高速出口)'], [], ['长寿收费站(G50沪渝高速出口)', '长寿收费站(G50沪渝高速入口)', '长寿收费站(S0101长涪高速出口长寿方向)', '长寿收费站(S0101长涪高速入口涪陵方向)'], ['夏坝收费站(S0101江綦高速入口)', '夏坝收费站(S0101江綦高速出口)'], ['大安收费站(G85银昆高速出口大安方向)', '大安收费站(G85银昆高速入口东向)', '大安收费站(G85银昆高速出口大安方向)', '大安收费站(G85银昆高速入口内江方向)'], ['邮亭收费站(G85银昆高速出口)', '邮亭收费站(G85银昆高速入口)'], ['荣昌西收费站(G85银昆高速出口荣昌西方向)', '荣昌西收费站(G85银昆高速入口西向)', '荣昌西收费站(G85银昆高速出口荣昌西方向)'], ['盐井收费站(G75兰海高速入口)', '盐井收费站(G75兰海高速出口)'], ['鸭江收费站(G69银百高速出口)', '鸭江收费站(G69银百高速入口)'], [], [], ['永川收费站(G85银昆高速入口)', '永川收费站(G85银昆高速出口)'], ['一品收费站(G75兰海高速出口)', '一品收费站(G75兰海高速入口)'], ['涪陵东收费站(G69银百高速出口)', '涪陵东收费站(G69银百高速入口)'], [], ['双河口收费站(G5021石渝高速出口)', '双河口收费站(G5021石渝高速入口)'], ['清溪收费站(G69银百高速入口)', '清溪收费站(G69银百高速出口)'], ['古佛收费站(G50沪渝高速入口)', '古佛收费站(G50沪渝高速出口)'], ['璧山南收费站(G85银昆高速出口璧山南方向)', '璧山南收费站(G85银昆高速入口西南向)', '璧山南收费站(G85银昆高速入口东向)'], [], [], ['龙孔收费站(G69银百高速入口)', '龙孔收费站(G69银百高速出口)'], ['金鸡收费站(G5515张南高速出口)', '金鸡收费站(G5515张南高速入口)'], ['水江收费站(G65包茂高速入口)', '水江收费站(G65包茂高速出口)'], ['古剑山收费站(G75兰海高速入口)', '古剑山收费站(G75兰海高速出口)'], ['山王坪收费站(G69银百高速出口)', '山王坪收费站(G69银百高速入口)'], ['龙水湖收费站(G8515广泸高速出口)', '龙水湖收费站(G8515广泸高速入口)'], ['白石收费站(G50沪渝高速入口)', '白石收费站(G50沪渝高速出口)'], ['三合收费站(S5九永高速出口)', '三合收费站(S5九永高速入口)'], [], ['潼南收费站(G93成渝环线高速入口)', '潼南收费站(G93成渝环线高速出口)'], ['龙潭收费站(G65包茂高速出口黔江方向)', '龙潭收费站(G65包茂高速入口南向)'], [], [], ['天城收费站(G42沪蓉高速入口)', '天城收费站(G42沪蓉高速出口)'], ['奉节收费站(G42沪蓉高速入口)', '奉节收费站(G42沪蓉高速出口)'], ['高嘴收费站(G65包茂高速入口西南向)', '高嘴收费站(G65包茂高速出口高嘴方向)'], ['福禄收费站(G5013渝蓉高速出口)', '福禄收费站(G5013渝蓉高速入口)'], [], ['铜梁东收费站(G93成渝环线高速入口)', '铜梁东收费站(G93成渝环线高速出口)'], [], ['小塆收费站(G93成渝环线高速出口)', '小塆收费站(G93成渝环线高速入口)'], ['玉屏收费站(G65包茂高速出口)', '玉屏收费站(G65包茂高速入口)'], ['彭水东收费站(G65包茂高速出口)', '彭水东收费站(G65包茂高速入口)'], ['铜梁南收费站(G8515广泸高速入口)', '铜梁南收费站(G8515广泸高速出口)'], ['永丰收费站(G50沪渝高速入口)', '永丰收费站(G50沪渝高速出口)'], ['石龙收费站(G65包茂高速出口)', '石龙收费站(G65包茂高速入口)'], ['南彭收费站(G65包茂高速出口)', '南彭收费站(G65包茂高速入口)'], [], ['秀山收费站(G65包茂高速出口)', '秀山收费站(G65包茂高速入口)'], ['二坪收费站(G8515广泸高速入口)', '二坪收费站(G8515广泸高速出口)'], ['长寿收费站(G50沪渝高速出口)', '长寿收费站(G50沪渝高速入口)', '长寿收费站(S0101长涪高速出口长寿方向)', '长寿收费站(S0101长涪高速入口涪陵方向)'], [], ['G93高新收费站(G85银昆高速东北向)', 'G93高新收费站(G85银昆高速西南向)'], ['沙子收费站(G50沪渝高速入口)', '沙子收费站(G50沪渝高速出口)'], [], ['广阳收费站(G5001重庆绕城高速入口)', '广阳收费站(G5001重庆绕城高速出口)'], ['北碚南收费站(G75兰海高速出口)', '北碚南收费站(G5001重庆绕城高速出口)'], ['白沙收费站(G93成渝环线高速出口)', '白沙收费站(G93成渝环线高速入口)'], ['丰都东收费站(G69银百高速出口)', '丰都东收费站(G69银百高速入口)'], ['沿溪收费站(G69银百高速出口)', '沿溪收费站(G69银百高速入口)'], [], ['王家收费站(G65包茂高速出口)', '王家收费站(G65包茂高速入口)'], ['草坪收费站(G65包茂高速出口)', '草坪收费站(G65包茂高速入口)'], ['香龙收费站(G85银昆高速出口)', '香龙收费站(G85银昆高速入口)'], ['双槐收费站(G85银昆高速入口)', '双槐收费站(G85银昆高速出口)'], ['三汇收费站(G85银昆高速入口)', '三汇收费站(G85银昆高速出口)'], ['复兴收费站(G85银昆高速出口)', '复兴收费站(G85银昆高速入口)'], [], [], ['S7高新南收费站(高盛大道出口)', 'S7高新南收费站(S5九永高速出口)'], ['三界收费站(S5九永高速入口)', '三界收费站(S5九永高速出口)'], [], ['惠民收费站(G5001重庆绕城高速出口)', '惠民收费站(G5001重庆绕城高速入口)'], ['空港东收费站(G5001重庆绕城高速出口)', '空港东收费站(G5001重庆绕城高速入口)'], ['大有收费站(G69银百高速入口)', '大有收费站(G69银百高速出口)'], [], ['万州收费站(G42沪蓉高速东北向)', '万州收费站(G42沪蓉高速西南向)'], ['云台收费站(G50沪渝高速出口)', '云台收费站(G50沪渝高速入口)'], ['开州收费站(G5012恩广高速出口)', '开州收费站(G5012恩广高速入口)'], ['大歇收费站(G50沪渝高速出口)', '大歇收费站(G50沪渝高速入口)'], ['荣昌东收费站(G85银昆高速入口永川方向)', '荣昌东收费站(G85银昆高速出口荣昌东方向)', '荣昌东收费站(G85银昆高速入口西向)', '荣昌东收费站(G85银昆高速出口荣昌东方向)'], ['水土收费站(G5001重庆绕城高速出口)', '水土收费站(G5001重庆绕城高速入口)'], [], ['忠兴收费站(G5001重庆绕城高速出口)', '忠兴收费站(G5001重庆绕城高速入口)'], ['支坪收费站(G5001重庆绕城高速入口)', '支坪收费站(G5001重庆绕城高速出口)'], ['双福南收费站(G93成渝环线高速入口)', '双福南收费站(G93成渝环线高速出口)'], ['铜梁西收费站(G8515广泸高速出口)', '铜梁西收费站(G8515广泸高速入口)'], ['铁山收费站(G5013渝蓉高速出口)', '铁山收费站(G5013渝蓉高速入口)'], ['大观收费站(G65包茂高速入口)', '大观收费站(G65包茂高速出口)'], ['箭沱湾收费站(G50沪渝高速出口箭沱湾方向)', '箭沱湾收费站(G50沪渝高速入口西向)'], [], ['G75巴南收费站(G75兰海高速北向)', 'G75巴南收费站(G75兰海高速南向)', 'G75巴南收费站'], ['高梁收费站(G42沪蓉高速入口)', '高梁收费站(G42沪蓉高速出口)'], [], ['高安收费站(G50沪渝高速入口)', '高安收费站(G50沪渝高速出口)'], ['南平收费站(S0101南万高速出口)', '南平收费站(S0101南万高速入口)'], ['彭水西收费站(G65包茂高速入口)'], [], [], ['小河收费站(S26酉沿高速入口)', '小河收费站(S26酉沿高速出口)'], ['永桐收费站(G7521渝筑高速入口)', '永桐收费站(G7521渝筑高速出口)'], ['G5021南岸收费站(绕城东互通西向)', 'G5021南岸收费站(绕城东互通东向)'], ['澄溪收费站(G50沪渝高速出口)', '澄溪收费站(G50沪渝高速入口)'], ['荣昌收费站(G85银昆高速入口)', '荣昌收费站(G85银昆高速出口)'], ['阿蓬江收费站(G65包茂高速入口)', '阿蓬江收费站(G65包茂高速出口)'], ['大路收费站(G93成渝环线高速出口)', '大路收费站(G93成渝环线高速入口)'], ['旧县收费站(G8515广泸高速出口)', '旧县收费站(G8515广泸高速入口)'], [], ['大湾收费站(G65包茂高速入口)', '大湾收费站(G65包茂高速出口)'], ['安富广顺收费站(S55潼荣高速出口)', '安富广顺收费站(S55潼荣高速入口)'], ['秀山南收费站(S63秀松高速入口)'], ['莲花收费站(S5九永高速入口)', '莲花收费站(S5九永高速出口)'], [], ['熊家收费站(G69银百高速入口)', '熊家收费站(G69银百高速出口)'], [], ['静观收费站(G85银昆高速出口)', '静观收费站(G85银昆高速入口)'], [], [], ['巨梁沱收费站(G75兰海高速入口东南向)', '巨梁沱收费站(G75兰海高速出口巨梁沱方向)'], ['珞璜收费站(G5001重庆绕城高速出口)', '珞璜收费站(G5001重庆绕城高速入口)'], [], ['塘坝收费站(S55潼荣高速入口)', '塘坝收费站(S55潼荣高速出口)'], ['卧佛收费站(S55潼荣高速出口)', '卧佛收费站(S55潼荣高速入口)'], [], ['麻柳河收费站(S0101三环高速出口)', '麻柳河收费站(S0101三环高速入口)'], ['双石收费站(G8515广泸高速入口)', '双石收费站(G8515广泸高速出口)', '双石收费站(G8515广泸高速入口)'], [], [], ['通惠收费站(S0101綦万高速入口)', '通惠收费站(S0101綦万高速出口)'], ['石柱收费站(G5021石渝高速出口)', '石柱收费站(G50沪渝高速入口)'], ['孙家收费站(G42沪蓉高速出口)', '孙家收费站(G42沪蓉高速入口)'], ['小周收费站(G42沪蓉高速出口)', '小周收费站(G42沪蓉高速入口)'], ['濯水收费站(G65包茂高速入口)', '濯水收费站(G65包茂高速出口)'], ['永川南收费站(S5九永高速入口)', '永川南收费站(S5九永高速出口)'], ['夔门收费站(G6911安来高速入口)', '夔门收费站(G6911安来高速出口)'], ['黔江西收费站(G65包茂高速出口)'], [], ['东胜收费站(G65包茂高速入口)', '东胜收费站(G65包茂高速出口)'], ['果园港收费站(G5001重庆绕城高速出口)', '果园港收费站(G5001重庆绕城高速入口)'], ['板溪收费站(G65包茂高速入口)', '板溪收费站(G65包茂高速出口)'], ['永新收费站(S0101江綦高速入口)', '永新收费站(S0101江綦高速出口)'], ['璧山北收费站(G93成渝环线高速出口)', '璧山北收费站(G93成渝环线高速入口)'], ['龙桥收费站(G5021石渝高速出口)', '龙桥收费站(G5021石渝高速入口)'], ['盐井沟收费站(G69银百高速出口)', '盐井沟收费站(G69银百高速入口)'], ['G65巴南收费站(G65包茂高速西北向)', 'G65巴南收费站(G65包茂高速东南向)'], ['松溉收费站(S0101三环高速入口)', '松溉收费站(S0101三环高速出口)'], [], ['珞璜收费站(G5001重庆绕城高速出口)', '珞璜收费站(G5001重庆绕城高速入口)'], [], [], ['少云收费站(G93成渝环线高速入口)', '少云收费站(G93成渝环线高速出口)'], [], ['丁家收费站(G85银昆高速入口)', '丁家收费站(G85银昆高速出口)'], ['江津南收费站(G93成渝环线高速出口)', '江津南收费站(G93成渝环线高速入口)'], ['但渡收费站(S0101长涪高速出口但渡方向)', '但渡收费站(S0101长涪高速出口但渡方向)', '但渡收费站(S0101长涪高速入口李渡方向)'], ['雍溪收费站(G8515广泸高速入口)', '雍溪收费站(G8515广泸高速出口)'], ['黑水收费站(G65包茂高速出口)', '黑水收费站(G65包茂高速入口)'], ['竹溪收费站(G5012恩广高速出口)', '竹溪收费站(G5012恩广高速入口)'], ['燕山收费站(G69银百高速出口)', '燕山收费站(G69银百高速入口)'], ['迎龙收费站(G5001重庆绕城高速入口)', '迎龙收费站(G5001重庆绕城高速出口)'], ['云龙收费站(G42沪蓉高速出口)', '云龙收费站(G42沪蓉高速入口)'], ['璧山收费站(G5013渝蓉高速出口)', '璧山收费站(G5013渝蓉高速入口)'], ['江口收费站(G65包茂高速出口)', '江口收费站(G65包茂高速入口)'], [], ['普乐收费站(G50沪渝高速出口)', '普乐收费站(G50沪渝高速出口)', '普乐收费站(G50沪渝高速入口)'], ['洛碛收费站(G50沪渝高速出口)', '洛碛收费站(G50沪渝高速入口)'], ['空港收费站(G5001重庆绕城高速入口)', '空港收费站(G5001重庆绕城高速出口)'], [], ['合阳收费站(G75兰海高速入口)', '合阳收费站(G75兰海高速出口)'], ['增福收费站(S37南两高速入口)', '增福收费站(S37南两高速出口)'], [], ['北固收费站(S37南两高速出口)', '北固收费站(S37南两高速入口)'], ['大寨收费站(S37南两高速入口)', '大寨收费站(S37南两高速出口)'], ['大顺收费站(S37南两高速入口)', '大顺收费站(S37南两高速出口)'], ['石溪收费站(S37南两高速出口)', '石溪收费站(S37南两高速入口)'], ['施家梁收费站(G5001重庆绕城高速出口)', '施家梁收费站(G5001重庆绕城高速入口)', '收费站(渝武高速复线出口)', '收费站(渝武高速复线入口)'], [], [], ['蓼子收费站(G69银百高速出口)'], ['雪宝山北收费站(G69银百高速入口)', '雪宝山北收费站(G69银百高速出口)'], ['雪宝山收费站(G69银百高速入口)', '雪宝山收费站(G69银百高速出口)'], ['谭家收费站(G69银百高速入口)', '谭家收费站(G69银百高速出口)'], ['温泉收费站(G69银百高速出口)', '温泉收费站(G69银百高速入口)'], ['白鹤收费站(G69银百高速出口)', '白鹤收费站(G69银百高速入口)'], ['开州东收费站(G69银百高速出口)', '开州东收费站(G69银百高速入口)'], ['开州港收费站(G69银百高速出口)', '开州港收费站(G69银百高速入口)'], ['龙头港收费站(G5021石渝高速出口)', '龙头港收费站(G5021石渝高速入口)'], ['新妙收费站(G5021石渝高速出口)', '新妙收费站(G5021石渝高速入口)'], ['合兴收费站(G50沪渝高速出口)', '合兴收费站(G50沪渝高速入口)'], ['丰都收费站(G69银百高速入口)', '丰都收费站(G69银百高速出口)'], ['云阳收费站(G42沪蓉高速出口)', '云阳收费站(G42沪蓉高速入口)'], ['何埂收费站(S0101三环高速出口)', '何埂收费站(S0101三环高速入口)'], ['歇马收费站(歇马互通出口西向)', '歇马收费站(歇马互通入口东向)'], ['双江潼南西收费站(G93成渝环线高速入口)'], [], [], [], ['李市收费站(S21江习高速入口)', '李市收费站(S21江习高速出口)'], ['潼南东收费站(S55潼荣高速入口)', '潼南东收费站(S55潼荣高速出口)'], ['龙岗收费站(S55潼荣高速出口)', '龙岗收费站(S55潼荣高速入口)'], ['塘河收费站(G93成渝环线高速出口)', '塘河收费站(G93成渝环线高速入口)'], ['平桥收费站(G69银百高速出口)', '平桥收费站(G69银百高速入口)'], ['赶水收费站(G75兰海高速出口)', '赶水收费站(G75兰海高速入口)'], ['万盛西收费站(S0101綦万高速入口)', '万盛西收费站(S0101綦万高速出口)'], ['忠县收费站(G50沪渝高速出口)', '忠县收费站(G50沪渝高速入口)'], [], ['拾万收费站(G8515广泸高速入口)', '拾万收费站(G8515广泸高速出口)'], ['蔡家收费站(S21江习高速入口)', '蔡家收费站(S21江习高速出口)'], [], ['潼南南收费站(S55潼荣高速入口)', '潼南南收费站(S55潼荣高速出口)'], ['石篆山收费站(S55潼荣高速入口)', '石篆山收费站(S55潼荣高速出口)'], [], [], [], ['桃花源收费站(G65包茂高速入口)', '桃花源收费站(G65包茂高速出口)'], ['贾嗣收费站(S0101江綦高速出口)', '贾嗣收费站(S0101江綦高速入口)'], ['双福北收费站(G93成渝环线高速出口)', '双福北收费站(G93成渝环线高速入口)'], ['三圣收费站(G85银昆高速出口)', '三圣收费站(G85银昆高速入口)'], ['来凤收费站(S5九永高速出口)', '来凤收费站(S5九永高速入口)'], ['陈食收费站(S5九永高速入口)', '陈食收费站(S5九永高速出口)'], ['新乡收费站(G69银百高速出口)', '新乡收费站(G69银百高速入口)'], ['垫江收费站(G42沪蓉高速出口)', '垫江收费站(G42沪蓉高速入口)'], ['李渡收费站(G5021石渝高速入口)', '李渡收费站(G5021石渝高速出口)'], ['西彭收费站(G93成渝环线高速出口)', '西彭收费站(G93成渝环线高速入口)', '西彭收费站(G93成渝环线高速入口)', '西彭收费站(G93成渝环线高速出口)'], [], [], ['收费站(G50沪渝高速入口)', '收费站(G50沪渝高速入口)'], ['仁义收费站(S55潼荣高速入口)', '仁义收费站(S55潼荣高速出口)'], [], [], ['江津南收费站(G93成渝环线高速出口)', '江津南收费站(G93成渝环线高速入口)'], ['协睦收费站(G5001重庆绕城高速入口)', '协睦收费站(G5001重庆绕城高速出口)'], ['梓里收费站(梓白高速出口梓里方向)'], ['白涛收费站(梓白高速入口)', '白涛收费站(梓白高速出口)'], ['来苏收费站(S7永泸高速出口)', '来苏收费站(S7永泸高速入口)'], ['宝峰收费站(S33泸永高速入口)', '宝峰收费站(S7永泸高速出口)'], ['云门北收费站(S9合安高速出口)', '云门北收费站(S9合安高速入口)'], ['大石收费站(S9合安高速入口)', '大石收费站(S9合安高速出口)'], [], [], ['走马收费站(G85银昆高速出口)', '走马收费站(G85银昆高速入口)', '走马收费站(G85银昆高速出口)', '走马收费站(G85银昆高速入口)'], ['梁平西收费站(G5515张南高速出口)', '梁平西收费站(G5515张南高速入口)'], [], ['金马收费站(G85银昆高速出口金马方向)', '金马收费站(G85银昆高速入口G93方向)'], ['隆兴收费站(S9合安高速入口)', '隆兴收费站(S9合安高速入口)'], ['龙形收费站(S9合安高速出口)', '龙形收费站(S9合安高速入口)'], [], ['崇龛收费站(S9合安高速出口)', '崇龛收费站(S9合安高速入口)'], [], ['龙潭河收费站(G5515张南高速出口)', '龙潭河收费站(G5515张南高速入口)'], [], ['连湖收费站(G5515张南高速出口)'], [], ['石会收费站(G5515张南高速入口)'], ['夔门收费站(G6911安来高速出口)', '夔门收费站(G6911安来高速入口)', '收费站'], ['石堰收费站(G50沪渝高速入口)', '石堰收费站(G50沪渝高速出口)'], ['逆地理编码失败'], ['巴岳收费站(S8铜安高速出口)', '巴岳收费站(S8铜安高速入口)'], ['平滩收费站(S8铜安高速入口)', '平滩收费站(S8铜安高速出口)'], ['小沔收费站(S47渝广高速出口)', '小沔收费站(S47渝广高速入口)'], [], [], ['大安收费站(G85银昆高速入口东向)', '大安收费站(G85银昆高速出口大安方向)', '大安收费站(G85银昆高速出口大安方向)', '大安收费站(G85银昆高速入口内江方向)'], ['隆盛收费站(G7521渝筑高速出口)'], ['永桐收费站(G7521渝筑高速入口)', '永桐收费站(G7521渝筑高速出口)'], ['青年收费站(G7521渝筑高速出口)', '青年收费站(G7521渝筑高速入口)'], [], [], ['安稳北收费站(G7521渝筑高速出口)', '安稳北收费站(G7521渝筑高速入口)', '安稳收费站(G75兰海高速出口)', '安稳收费站(G75兰海高速入口)'], ['中峰收费站(S53合璧津高速出口)', '中峰收费站(S53合璧津高速入口)'], ['依凤收费站(S53合璧津高速出口)', '依凤收费站(S53合璧津高速入口)'], ['河边收费站(S53合璧津高速入口)', '河边收费站(S53合璧津高速出口)'], ['G7521巴南收费站(G7521渝筑高速出口)', 'G7521巴南收费站(G7521渝筑高速入口)'], ['接龙北收费站(G7521渝筑高速入口)', '接龙北收费站(G7521渝筑高速出口)'], ['接龙南收费站(G7521渝筑高速出口)', '接龙南收费站(G7521渝筑高速入口)'], ['璧山西收费站(S53合璧津高速出口)', '璧山西收费站(S53合璧津高速入口)'], ['慧谷湖收费站(S0101长涪高速出口)', '慧谷湖收费站(S0101长涪高速入口)'], ['九峰山收费站(G8515广泸高速入口)', '九峰山收费站(G8515广泸高速出口)'], ['三驱收费站(S34大内高速入口)', '三驱收费站(S34大内高速出口)'], ['季家收费站(S34大内高速入口)', '季家收费站(S34大内高速出口)'], ['铜鼓收费站(S34大内高速出口)', '铜鼓收费站(S34大内高速入口)'], [], ['新林收费站(S9合安高速入口)', '新林收费站(S9合安高速出口)'], [], ['收费站(S80三环高速出口东北向)', '收费站(S80三环高速入口西南向)', '收费站(渝武高速复线入口东南向)', '收费站(渝武高速复线出口西向)'], ['玉龙收费站(S80三环高速入口)', '玉龙收费站(S80三环高速出口)'], ['天顶收费站(S80三环高速入口)', '天顶收费站(S80三环高速出口)'], ['木耳收费站(S80三环高速出口)', '木耳收费站(S80三环高速入口)'], ['统景收费站(S80三环高速出口)', '统景收费站(S80三环高速入口)'], ['石船收费站(石船互通入口西向)', '石船收费站(石船互通出口东向)'], ['长寿北收费站(S39渝长复线入口)', '长寿北收费站(S39渝长复线出口)'], ['八颗收费站(S39渝长复线出口)', '八颗收费站(S39渝长复线入口)'], ['长寿西收费站(S39渝长复线入口)', '长寿西收费站(S39渝长复线出口)'], [], ['五宝收费站(S39渝长复线入口)', '五宝收费站(S39渝长复线出口)', '箭沱湾收费站(G50沪渝高速入口西向)', '箭沱湾收费站(G50沪渝高速出口箭沱湾方向)'], ['石庙收费站(S39渝长复线出口重庆主城方向)', '石庙收费站(S39渝长复线入口东北向)'], ['一品收费站(G75兰海高速出口)', '一品收费站(G75兰海高速入口)'], ['大昌收费站(S11城巫高速入口S11方向)', '大昌收费站(S11城巫高速出口大昌方向)'], ['龙雾收费站(S11城巫高速入口)', '龙雾收费站(S11城巫高速出口)'], ['高峰收费站(G5012恩广高速入口)', '高峰收费站(G5012恩广高速出口)'], ['静观收费站(G85银昆高速出口)', '静观收费站(G85银昆高速入口)'], ['油沙收费站(G5012恩广高速出口)', '油沙收费站(G5012恩广高速入口)'], ['新田港收费站(G5012恩广高速出口)', '新田港收费站(G5012恩广高速入口)'], ['德感收费站(S6渝泸高速入口)', '德感收费站(S6渝泸高速出口)'], ['油溪收费站(永津高速入口西北向)', '油溪收费站(永津高速出口东南向)'], ['石门收费站(S6渝泸高速出口)', '石门收费站(S6渝泸高速入口)'], ['朱杨收费站(S6渝泸高速出口)', '朱杨收费站(S6渝泸高速入口)']]
#list_2 = [i for i in list if len(i) > 0]
#list_3 = [['雷神店收费站(G75兰海高速入口西北向)', '雷神店收费站(G75兰海高速出口三江方向)', '雷神店收费站(G75兰海高速出口三江方向)', '雷神店收费站(G75兰海高速入口东南向)'], ['万盛西收费站(S0101綦万高速入口)', '万盛西收费站(S0101綦万高速出口)'], ['周嘉收费站(G42沪蓉高速出口)', '周嘉收费站(G42沪蓉高速入口)'], ['雅江收费站(G65包茂高速出口)', '雅江收费站(G65包茂高速入口)'], [], ['田家收费站(G93成渝环线高速入口)', '田家收费站(G93成渝环线高速出口)'], [], ['三教收费站(G8515广泸高速入口)', '三教收费站(G8515广泸高速出口)'], ['新立收费站(G50沪渝高速入口)', '新立收费站(G50沪渝高速出口)'], ['安稳北收费站(G7521渝筑高速出口)', '安稳北收费站(G7521渝筑高速入口)', '安稳收费站(G75兰海高速出口)', '安稳收费站(G75兰海高速入口)'], [], ['麻柳嘴收费站(G5021石渝高速出口)', '麻柳嘴收费站', '麻柳嘴收费站(G5021石渝高速入口)'], ['高家镇收费站(G69银百高速出口)', '高家镇收费站(G69银百高速入口)'], ['洋渡收费站(G69银百高速出口)', '洋渡收费站(G69银百高速入口)'], ['西沱收费站(G69银百高速出口)', '西沱收费站(G69银百高速入口)'], ['三泉收费站(G69银百高速出口)', '三泉收费站(G69银百高速入口)'], ['铁门收费站(G5515张南高速入口)', '铁门收费站(G5515张南高速出口)'], ['西湖收费站(S0101江綦高速出口)', '西湖收费站(S0101江綦高速入口)'], ['合川收费站(G75兰海高速出口南充方向)', '合川收费站(G75兰海高速入口东南向)', '合川收费站(G75兰海高速出口)', '合川收费站(G75兰海高速入口)'], ['袁驿收费站(G5515张南高速出口)', '袁驿收费站(G5515张南高速入口)'], ['钱塘收费站(G75兰海高速入口)', '钱塘收费站(G75兰海高速出口)'], ['晏家收费站(G50沪渝高速入口)', '晏家收费站(G50沪渝高速出口)'], ['万古收费站(G8515广泸高速入口)', '万古收费站(G8515广泸高速出口)'], ['民国场收费站(G69银百高速出口)', '民国场收费站(G69银百高速入口)'], [], ['大足收费站(G5013渝蓉高速出口)', '大足收费站(G5013渝蓉高速入口)'], ['南雅收费站(G5012恩广高速入口)', '南雅收费站(G5012恩广高速出口)'], ['东阳收费站(G75兰海高速入口)', '东阳收费站(G75兰海高速出口)', '收费站(渝武高速复线入口)', '收费站(渝武高速复线出口)'], ['草街收费站(G75兰海高速出口)', '草街收费站(G75兰海高速入口)', '收费站(渝武高速复线出口)', '收费站(渝武高速复线入口)'], ['丰盛收费站(G5021石渝高速入口)', '丰盛收费站(G5021石渝高速出口)'], ['永川西收费站(S0101三环高速入口)', '永川西收费站(S0101三环高速出口)'], [], ['南川收费站(G65包茂高速入口)', '南川收费站(G65包茂高速出口)'], ['红狮收费站(G42沪蓉高速入口)', '红狮收费站(G42沪蓉高速出口)'], ['巫溪收费站(G6911安来高速出口)', '巫溪收费站(G6911安来高速入口)'], ['北渡收费站(S0101江綦高速出口)', '北渡收费站(S0101江綦高速入口)'], ['东溪收费站(G75兰海高速入口)', '东溪收费站(G75兰海高速出口)'], ['綦江收费站(G75兰海高速出口)', '綦江收费站(G75兰海高速入口)'], ['大庙收费站(G5013渝蓉高速入口)', '大庙收费站(G5013渝蓉高速出口)'], ['马武收费站(G69银百高速入口)', '马武收费站(G69银百高速出口)'], ['黔江南收费站(G65包茂高速入口)', '黔江南收费站(G65包茂高速出口)'], ['草堂收费站(G42沪蓉高速入口)', '草堂收费站(G42沪蓉高速出口)'], [], ['长寿收费站(G50沪渝高速出口)', '长寿收费站(G50沪渝高速入口)', '长寿收费站(S0101长涪高速出口长寿方向)', '长寿收费站(S0101长涪高速入口涪陵方向)'], ['夏坝收费站(S0101江綦高速入口)', '夏坝收费站(S0101江綦高速出口)'], ['大安收费站(G85银昆高速出口大安方向)', '大安收费站(G85银昆高速入口东向)', '大安收费站(G85银昆高速出口大安方向)', '大安收费站(G85银昆高速入口内江方向)', '收费站(永璧高速入口北向)', '收费站(永璧高速出口南向)'], ['邮亭收费站(G85银昆高速出口)', '邮亭收费站(G85银昆高速入口)'], ['荣昌西收费站(G85银昆高速出口荣昌西方向)', '荣昌西收费站(G85银昆高速入口西向)', '荣昌西收费站(G85银昆高速出口荣昌西方向)'], ['盐井收费站(G75兰海高速入口)', '盐井收费站(G75兰海高速出口)', '巨梁沱收费站(G75兰海高速出口巨梁沱方向)', '巨梁沱收费站(G75兰海高速入口东南向)'], ['鸭江收费站(G69银百高速出口)', '鸭江收费站(G69银百高速入口)'], ['南沱收费站(G69银百高速入口)', '南沱收费站(G69银百高速出口)'], [], ['永川收费站(G85银昆高速入口)', '永川收费站(G85银昆高速出口)'], ['一品收费站(G75兰海高速出口)', '一品收费站(G75兰海高速入口)'], ['涪陵东收费站(G69银百高速出口)', '涪陵东收费站(G69银百高速入口)'], [], ['双河口收费站(G5021石渝高速出口)', '双河口收费站(G5021石渝高速入口)'], ['清溪收费站(G69银百高速入口)', '清溪收费站(G69银百高速出口)'], ['古佛收费站(G50沪渝高速入口)', '古佛收费站(G50沪渝高速出口)'], ['璧山南收费站(G85银昆高速出口璧山南方向)', '璧山南收费站(G85银昆高速入口西南向)', '璧山南收费站(G85银昆高速入口东向)'], ['羊桥坝收费站(G6911安来高速入口)', '羊桥坝收费站(G6911安来高速出口)'], ['马灌收费站(G5515张南高速出口)', '马灌收费站(G5515张南高速入口)'], ['龙孔收费站(G69银百高速入口)', '龙孔收费站(G69银百高速出口)'], ['金鸡收费站(G5515张南高速出口)', '金鸡收费站(G5515张南高速入口)'], ['水江收费站(G65包茂高速入口)', '水江收费站(G65包茂高速出口)'], ['古剑山收费站(G75兰海高速入口)', '古剑山收费站(G75兰海高速出口)', '綦江南收费站(S0101江綦高速入口)', '綦江南收费站(S0101江綦高速出口)'], ['山王坪收费站(G69银百高速出口)', '山王坪收费站(G69银百高速入口)'], ['龙水湖收费站(G8515广泸高速出口)', '龙水湖收费站(G8515广泸高速入口)'], ['白石收费站(G50沪渝高速入口)', '白石收费站(G50沪渝高速出口)'], ['三合收费站(S5九永高速出口)', '三合收费站(S5九永高速入口)'], [], ['潼南收费站(G93成渝环线高速入口)', '潼南收费站(G93成渝环线高速出口)'], ['龙潭收费站(G65包茂高速出口黔江方向)', '龙潭收费站(G65包茂高速入口南向)'], ['武隆收费站(G65包茂高速出口)', '武隆收费站(G65包茂高速入口)'], ['丛林收费站(S0101南万高速出口)', '丛林收费站(S0101南万高速入口)'], ['天城收费站(G42沪蓉高速入口)', '天城收费站(G42沪蓉高速出口)'], ['奉节收费站(G42沪蓉高速入口)', '奉节收费站(G42沪蓉高速出口)'], ['高嘴收费站(G65包茂高速入口西南向)', '高嘴收费站(G65包茂高速出口高嘴方向)'], ['福禄收费站(G5013渝蓉高速出口)', '福禄收费站(G5013渝蓉高速入口)'], ['铜梁收费站(G93成渝环线高速出口)', '铜梁收费站(G93成渝环线高速入口)'], ['铜梁东收费站(G93成渝环线高速入口)', '铜梁东收费站(G93成渝环线高速出口)'], ['百合收费站(G5001重庆绕城高速出口)', '百合收费站(G5001重庆绕城高速入口)'], ['小塆收费站(G93成渝环线高速出口)', '小塆收费站(G93成渝环线高速入口)'], ['玉屏收费站(G65包茂高速出口)', '玉屏收费站(G65包茂高速入口)'], ['彭水东收费站(G65包茂高速出口)', '彭水东收费站(G65包茂高速入口)'], ['铜梁南收费站(G8515广泸高速入口)', '铜梁南收费站(G8515广泸高速出口)'], ['永丰收费站(G50沪渝高速入口)', '永丰收费站(G50沪渝高速出口)'], ['石龙收费站(G65包茂高速出口)', '石龙收费站(G65包茂高速入口)'], ['南彭收费站(G65包茂高速出口)', '南彭收费站(G65包茂高速入口)'], ['保家收费站(G65包茂高速入口)', '保家收费站(G65包茂高速出口)'], ['秀山收费站(G65包茂高速出口)', '秀山收费站(G65包茂高速入口)'], ['二坪收费站(G8515广泸高速入口)', '二坪收费站(G8515广泸高速出口)'], ['长寿收费站(G50沪渝高速出口)', '长寿收费站(G50沪渝高速入口)', '长寿收费站(S0101长涪高速出口长寿方向)', '长寿收费站(S0101长涪高速入口涪陵方向)'], ['涪陵南收费站(G69银百高速入口西北向)', '涪陵南收费站(G69银百高速出口涪陵南方向)'], ['G93高新收费站(G85银昆高速东北向)', 'G93高新收费站(G85银昆高速西南向)', '收费站(G85银昆高速入口西南向)', '收费站(G85银昆高速出口东北向)'], ['沙子收费站(G50沪渝高速入口)', '沙子收费站(G50沪渝高速出口)'], ['铜梁北收费站(G93成渝环线高速入口)', '铜梁北收费站(G93成渝环线高速出口)'], ['广阳收费站(G5001重庆绕城高速入口)', '广阳收费站(G5001重庆绕城高速出口)'], ['北碚南收费站(G75兰海高速出口)', '北碚南收费站(G5001重庆绕城高速出口)'], ['白沙收费站(G93成渝环线高速出口)', '白沙收费站(G93成渝环线高速入口)'], ['丰都东收费站(G69银百高速出口)', '丰都东收费站(G69银百高速入口)'], ['沿溪收费站(G69银百高速出口)', '沿溪收费站(G69银百高速入口)'], ['丰都西收费站(G69银百高速入口)', '丰都西收费站(G69银百高速出口)'], ['王家收费站(G65包茂高速出口)', '王家收费站(G65包茂高速入口)'], ['草坪收费站(G65包茂高速出口)', '草坪收费站(G65包茂高速入口)'], ['香龙收费站(G85银昆高速出口)', '香龙收费站(G85银昆高速入口)'], ['双槐收费站(G85银昆高速入口)', '双槐收费站(G85银昆高速出口)'], ['三汇收费站(G85银昆高速入口)', '三汇收费站(G85银昆高速出口)'], ['复兴收费站(G85银昆高速出口)', '复兴收费站(G85银昆高速入口)'], [], [], ['S7高新南收费站(高盛大道出口)', 'S7高新南收费站(S5九永高速出口)'], ['三界收费站(S5九永高速入口)', '三界收费站(S5九永高速出口)', '走马收费站(G85银昆高速入口)', '走马收费站(G85银昆高速出口)'], ['拔山收费站(G5515张南高速入口)', '拔山收费站(G5515张南高速出口)'], ['惠民收费站(G5001重庆绕城高速出口)', '惠民收费站(G5001重庆绕城高速入口)', '收费站(渝湘复线高速出口)', '收费站(渝湘复线高速入口)'], ['空港东收费站(G5001重庆绕城高速出口)', '空港东收费站(G5001重庆绕城高速入口)'], ['大有收费站(G69银百高速入口)', '大有收费站(G69银百高速出口)'], ['磨子收费站(G50沪渝高速出口)', '磨子收费站(G50沪渝高速入口)'], ['万州收费站(G42沪蓉高速东北向)', '万州收费站(G42沪蓉高速西南向)'], ['云台收费站(G50沪渝高速出口)', '云台收费站(G50沪渝高速入口)'], ['开州收费站(G5012恩广高速出口)', '开州收费站(G5012恩广高速入口)'], ['大歇收费站(G50沪渝高速出口)', '大歇收费站(G50沪渝高速入口)'], ['荣昌东收费站(G85银昆高速入口永川方向)', '荣昌东收费站(G85银昆高速出口荣昌东方向)', '荣昌东收费站(G85银昆高速入口西向)', '荣昌东收费站(G85银昆高速出口荣昌东方向)'], ['水土收费站(G5001重庆绕城高速出口)', '水土收费站(G5001重庆绕城高速入口)'], ['龙兴收费站(G5001重庆绕城高速出口)', '龙兴收费站(G5001重庆绕城高速入口)', '协睦收费站(现代大道入口西向)', '协睦收费站(现代大道出口北碚方向)'], ['忠兴收费站(G5001重庆绕城高速出口)', '忠兴收费站(G5001重庆绕城高速入口)', 'G7521巴南收费站(G7521渝筑高速出口)', 'G7521巴南收费站(G7521渝筑高速入口)'], ['支坪收费站(G5001重庆绕城高速入口)', '支坪收费站(G5001重庆绕城高速出口)'], ['双福南收费站(G93成渝环线高速入口)', '双福南收费站(G93成渝环线高速出口)'], ['铜梁西收费站(G8515广泸高速出口)', '铜梁西收费站(G8515广泸高速入口)'], ['铁山收费站(G5013渝蓉高速出口)', '铁山收费站(G5013渝蓉高速入口)'], ['大观收费站(G65包茂高速入口)', '大观收费站(G65包茂高速出口)'], ['箭沱湾收费站(G50沪渝高速出口箭沱湾方向)', '箭沱湾收费站(G50沪渝高速入口西向)', '五宝收费站(S39渝长复线入口)', '五宝收费站(S39渝长复线出口)'], [], ['G75巴南收费站(G75兰海高速北向)', 'G75巴南收费站(G75兰海高速南向)', 'G75巴南收费站', '新玉收费站(G75兰海高速出口鱼洞方向)', '新玉收费站(G75兰海高速入口西南向)'], ['高梁收费站(G42沪蓉高速入口)', '高梁收费站(G42沪蓉高速出口)'], [], ['高安收费站(G50沪渝高速入口)', '高安收费站(G50沪渝高速出口)'], ['南平收费站(S0101南万高速出口)', '南平收费站(S0101南万高速入口)'], ['彭水西收费站(G65包茂高速入口)'], [], [], ['小河收费站(S26酉沿高速入口)', '小河收费站(S26酉沿高速出口)'], ['永桐收费站(G7521渝筑高速入口)', '永桐收费站(G7521渝筑高速出口)'], ['G5021南岸收费站(绕城东互通西向)', 'G5021南岸收费站(绕城东互通东向)'], ['澄溪收费站(G50沪渝高速出口)', '澄溪收费站(G50沪渝高速入口)'], ['荣昌收费站(G85银昆高速入口)', '荣昌收费站(G85银昆高速出口)'], ['阿蓬江收费站(G65包茂高速入口)', '阿蓬江收费站(G65包茂高速出口)'], ['大路收费站(G93成渝环线高速出口)', '大路收费站(G93成渝环线高速入口)'], ['旧县收费站(G8515广泸高速出口)', '旧县收费站(G8515广泸高速入口)'], [], ['大湾收费站(G65包茂高速入口)', '大湾收费站(G65包茂高速出口)'], ['安富广顺收费站(S55潼荣高速出口)', '安富广顺收费站(S55潼荣高速入口)'], ['秀山南收费站(S63秀松高速入口)', '秀山南收费站(S63秀松高速出口)'], ['莲花收费站(S5九永高速入口)', '莲花收费站(S5九永高速出口)'], [], ['熊家收费站(G69银百高速入口)', '熊家收费站(G69银百高速出口)'], [], ['静观收费站(G85银昆高速出口)', '静观收费站(G85银昆高速入口)'], ['中山收费站(S21江习高速出口)', '中山收费站(S21江习高速入口)'], [], ['巨梁沱收费站(G75兰海高速入口东南向)', '巨梁沱收费站(G75兰海高速出口巨梁沱方向)', '盐井收费站(G75兰海高速入口)', '盐井收费站(G75兰海高速出口)'], ['珞璜收费站(G5001重庆绕城高速出口)', '珞璜收费站(G5001重庆绕城高速入口)', '珞璜西收费站(G5001重庆绕城高速出口)', '珞璜西收费站(G5001重庆绕城高速入口)'], [], ['塘坝收费站(S55潼荣高速入口)', '塘坝收费站(S55潼荣高速出口)'], ['卧佛收费站(S55潼荣高速出口)', '卧佛收费站(S55潼荣高速入口)'], [], ['麻柳河收费站(S0101三环高速出口)', '麻柳河收费站(S0101三环高速入口)'], ['双石收费站(G8515广泸高速入口)', '双石收费站(G8515广泸高速出口)', '双石收费站(G8515广泸高速入口)'], ['文凤收费站(S0101南万高速入口)', '文凤收费站(S0101南万高速出口)'], ['五间收费站(S0101三环高速入口)', '五间收费站(S0101三环高速出口)'], ['通惠收费站(S0101綦万高速入口)', '通惠收费站(S0101綦万高速出口)'], ['石柱收费站(G5021石渝高速出口)', '石柱收费站(G50沪渝高速入口)'], ['孙家收费站(G42沪蓉高速出口)', '孙家收费站(G42沪蓉高速入口)'], ['小周收费站(G42沪蓉高速出口)', '小周收费站(G42沪蓉高速入口)'], ['濯水收费站(G65包茂高速入口)', '濯水收费站(G65包茂高速出口)'], ['永川南收费站(S5九永高速入口)', '永川南收费站(S5九永高速出口)'], ['夔门收费站(G6911安来高速入口)', '夔门收费站(G6911安来高速出口)', '收费站', '收费站(G6911安来高速出口)', '收费站(G6911安来高速入口)'], ['黔江西收费站(G65包茂高速出口)'], ['G5013科学城收费站(鼎新大道出口)', 'G5013科学城收费站(G5013渝蓉高速出口)', '青木关收费站(G5001重庆绕城高速入口)', '青木关收费站(G5001重庆绕城高速出口)'], ['东胜收费站(G65包茂高速入口)', '东胜收费站(G65包茂高速出口)'], ['果园港收费站(G5001重庆绕城高速出口)', '果园港收费站(G5001重庆绕城高速入口)', 'G50江北收费站(G50沪渝高速东向)', 'G50江北收费站(G50沪渝高速西向)'], ['板溪收费站(G65包茂高速入口)', '板溪收费站(G65包茂高速出口)'], ['永新收费站(S0101江綦高速入口)', '永新收费站(S0101江綦高速出口)'], ['璧山北收费站(G93成渝环线高速出口)', '璧山北收费站(G93成渝环线高速入口)'], ['龙桥收费站(G5021石渝高速出口)', '龙桥收费站(G5021石渝高速入口)', '涪陵西收费站(G5021石渝高速入口)', '涪陵西收费站(G5021石渝高速出口)'], ['盐井沟收费站(G69银百高速出口)', '盐井沟收费站(G69银百高速入口)'], ['G65巴南收费站(G65包茂高速西北向)', 'G65巴南收费站(G65包茂高速东南向)'], ['松溉收费站(S0101三环高速入口)', '松溉收费站(S0101三环高速出口)'], ['青木关收费站', '青木关收费站(G5001重庆绕城高速出口)', '青木关收费站(G5001重庆绕城高速入口)'], ['珞璜收费站(G5001重庆绕城高速出口)', '珞璜收费站(G5001重庆绕城高速入口)', '珞璜西收费站(G5001重庆绕城高速出口)', '珞璜西收费站(G5001重庆绕城高速入口)'], ['石柱西收费站(G5021石渝高速入口)'], [], ['少云收费站(G93成渝环线高速入口)', '少云收费站(G93成渝环线高速出口)'], ['边城收费站(G65包茂高速入口)', '边城收费站(G65包茂高速出口)'], ['丁家收费站(G85银昆高速入口)', '丁家收费站(G85银昆高速出口)'], ['江津南收费站(G93成渝环线高速出口)', '江津南收费站(G93成渝环线高速入口)'], ['但渡收费站(S0101长涪高速出口但渡方向)', '但渡收费站(S0101长涪高速出口但渡方向)', '但渡收费站(S0101长涪高速入口李渡方向)'], ['雍溪收费站(G8515广泸高速入口)', '雍溪收费站(G8515广泸高速出口)'], ['黑水收费站(G65包茂高速出口)', '黑水收费站(G65包茂高速入口)'], ['竹溪收费站(G5012恩广高速出口)', '竹溪收费站(G5012恩广高速入口)'], ['燕山收费站(G69银百高速出口)', '燕山收费站(G69银百高速入口)'], ['迎龙收费站(G5001重庆绕城高速入口)', '迎龙收费站(G5001重庆绕城高速出口)'], ['云龙收费站(G42沪蓉高速出口)', '云龙收费站(G42沪蓉高速入口)'], ['璧山收费站(G5013渝蓉高速出口)', '璧山收费站(G5013渝蓉高速入口)'], ['江口收费站(G65包茂高速出口)', '江口收费站(G65包茂高速入口)'], [], ['普乐收费站(G50沪渝高速出口)', '普乐收费站(G50沪渝高速出口)', '普乐收费站(G50沪渝高速入口)'], ['洛碛收费站(G50沪渝高速出口)', '洛碛收费站(G50沪渝高速入口)'], ['空港收费站(G5001重庆绕城高速入口)', '空港收费站(G5001重庆绕城高速出口)'], [], ['合阳收费站(G75兰海高速入口)', '合阳收费站(G75兰海高速出口)'], ['增福收费站(S37南两高速入口)', '增福收费站(S37南两高速出口)'], [], ['北固收费站(S37南两高速出口)', '北固收费站(S37南两高速入口)'], ['大寨收费站(S37南两高速入口)', '大寨收费站(S37南两高速出口)'], ['大顺收费站(S37南两高速入口)', '大顺收费站(S37南两高速出口)'], ['石溪收费站(S37南两高速出口)', '石溪收费站(S37南两高速入口)'], ['施家梁收费站(G5001重庆绕城高速出口)', '施家梁收费站(G5001重庆绕城高速入口)', '收费站(渝武高速复线出口)', '收费站(渝武高速复线入口)'], [], [], ['蓼子收费站(G69银百高速出口)'], ['雪宝山北收费站(G69银百高速入口)', '雪宝山北收费站(G69银百高速出口)'], ['雪宝山收费站(G69银百高速入口)', '雪宝山收费站(G69银百高速出口)'], ['谭家收费站(G69银百高速入口)', '谭家收费站(G69银百高速出口)'], ['温泉收费站(G69银百高速出口)', '温泉收费站(G69银百高速入口)'], ['白鹤收费站(G69银百高速出口)', '白鹤收费站(G69银百高速入口)'], ['开州东收费站(G69银百高速出口)', '开州东收费站(G69银百高速入口)'], ['开州港收费站(G69银百高速出口)', '开州港收费站(G69银百高速入口)'], ['龙头港收费站(G5021石渝高速出口)', '龙头港收费站(G5021石渝高速入口)'], ['新妙收费站(G5021石渝高速出口)', '新妙收费站(G5021石渝高速入口)'], ['合兴收费站(G50沪渝高速出口)', '合兴收费站(G50沪渝高速入口)'], ['丰都收费站(G69银百高速入口)', '丰都收费站(G69银百高速出口)'], ['云阳收费站(G42沪蓉高速出口)', '云阳收费站(G42沪蓉高速入口)'], ['何埂收费站(S0101三环高速出口)', '何埂收费站(S0101三环高速入口)'], ['歇马收费站(歇马互通出口西向)', '歇马收费站(歇马互通入口东向)'], ['双江潼南西收费站(G93成渝环线高速入口)'], ['巫山东收费站(G42沪蓉高速入口)', '巫山东收费站(G42沪蓉高速出口巴东方向)', '巫山收费站(G42沪蓉高速入口)', '巫山收费站(S11城巫高速出口)'], [], [], ['李市收费站(S21江习高速入口)', '李市收费站(S21江习高速出口)'], ['潼南东收费站(S55潼荣高速入口)', '潼南东收费站(S55潼荣高速出口)'], ['龙岗收费站(S55潼荣高速出口)', '龙岗收费站(S55潼荣高速入口)'], ['塘河收费站(G93成渝环线高速出口)', '塘河收费站(G93成渝环线高速入口)'], ['平桥收费站(G69银百高速出口)', '平桥收费站(G69银百高速入口)'], ['赶水收费站(G75兰海高速出口)', '赶水收费站(G75兰海高速入口)'], ['万盛西收费站(S0101綦万高速入口)', '万盛西收费站(S0101綦万高速出口)'], ['忠县收费站(G50沪渝高速出口)', '忠县收费站(G50沪渝高速入口)'], ['骡坪收费站(G42沪蓉高速入口)', '骡坪收费站(G42沪蓉高速出口)'], ['拾万收费站(G8515广泸高速入口)', '拾万收费站(G8515广泸高速出口)'], ['蔡家收费站(S21江习高速入口)', '蔡家收费站(S21江习高速出口)'], ['来凤收费站(S5九永高速入口)'], ['潼南南收费站(S55潼荣高速入口)', '潼南南收费站(S55潼荣高速出口)'], ['石篆山收费站(S55潼荣高速入口)', '石篆山收费站(S55潼荣高速出口)'], [], [], ['傅家收费站(S21江习高速入口)', '傅家收费站(S21江习高速出口)'], ['桃花源收费站(G65包茂高速入口)', '桃花源收费站(G65包茂高速出口)'], ['贾嗣收费站(S0101江綦高速出口)', '贾嗣收费站(S0101江綦高速入口)'], ['双福北收费站(G93成渝环线高速出口)', '双福北收费站(G93成渝环线高速入口)', '三界收费站(S5九永高速出口)', '三界收费站(S5九永高速入口)'], ['三圣收费站(G85银昆高速出口)', '三圣收费站(G85银昆高速入口)'], ['来凤收费站(S5九永高速出口)', '来凤收费站(S5九永高速入口)'], ['陈食收费站(S5九永高速入口)', '陈食收费站(S5九永高速出口)'], ['新乡收费站(G69银百高速出口)', '新乡收费站(G69银百高速入口)'], ['垫江收费站(G42沪蓉高速出口)', '垫江收费站(G42沪蓉高速入口)'], ['李渡收费站(G5021石渝高速入口)', '李渡收费站(G5021石渝高速出口)'], ['西彭收费站(G93成渝环线高速出口)', '西彭收费站(G93成渝环线高速入口)', '西彭收费站(G93成渝环线高速入口)', '西彭收费站(G93成渝环线高速出口)'], ['复盛收费站(G50沪渝高速出口)', '复盛收费站(G50沪渝高速入口)', '复盛收费站(G50沪渝高速入口)'], ['临江收费站(G5012恩广高速入口)', '临江收费站(G5012恩广高速出口)'], ['收费站(G50沪渝高速入口)', '收费站(G50沪渝高速入口)', '河源收费站(G50沪渝高速出口)', '河源收费站(G50沪渝高速入口)'], ['仁义收费站(S55潼荣高速入口)', '仁义收费站(S55潼荣高速出口)'], ['綦江南收费站(S0101江綦高速入口)', '綦江南收费站(S0101江綦高速出口)'], ['刁家收费站(G93成渝环线高速入口)', '刁家收费站(G93成渝环线高速出口)'], ['江津南收费站(G93成渝环线高速出口)', '江津南收费站(G93成渝环线高速入口)'], ['协睦收费站(G5001重庆绕城高速入口)', '协睦收费站(G5001重庆绕城高速出口)', '协睦收费站(现代大道入口西向)', '协睦收费站(现代大道出口北碚方向)'], ['梓里收费站(梓白高速出口梓里方向)'], ['白涛收费站(梓白高速入口)', '白涛收费站(梓白高速出口)'], ['来苏收费站(S7永泸高速出口)', '来苏收费站(S7永泸高速入口)'], ['宝峰收费站(S33泸永高速入口)', '宝峰收费站(S7永泸高速出口)'], ['云门北收费站(S9合安高速出口)', '云门北收费站(S9合安高速入口)'], ['大石收费站(S9合安高速入口)', '大石收费站(S9合安高速出口)'], ['太和收费站(S9合安高速入口)', '太和收费站(S9合安高速出口)'], ['云阳东收费站(G42沪蓉高速入口)', '云阳东收费站(G42沪蓉高速出口)'], ['走马收费站(G85银昆高速出口)', '走马收费站(G85银昆高速入口)', '走马收费站(G85银昆高速出口)', '走马收费站(G85银昆高速入口)', '三界收费站(S5九永高速入口)', '三界收费站(S5九永高速出口)'], ['梁平西收费站(G5515张南高速出口)', '梁平西收费站(G5515张南高速入口)'], [], ['金马收费站(G85银昆高速出口金马方向)', '金马收费站(G85银昆高速入口G93方向)', '收费站(G85银昆高速出口东北向)', '收费站(G85银昆高速入口西南向)'], ['隆兴收费站(S9合安高速入口)', '隆兴收费站(S9合安高速入口)', '隆兴收费站(S9合安高速出口)', '隆兴收费站(S9合安高速出口)'], ['龙形收费站(S9合安高速出口)', '龙形收费站(S9合安高速入口)'], ['潼南北收费站(S9合安高速入口)', '潼南北收费站(S9合安高速出口)'], ['崇龛收费站(S9合安高速出口)', '崇龛收费站(S9合安高速入口)'], [], ['龙潭河收费站(G5515张南高速出口)', '龙潭河收费站(G5515张南高速入口)'], ['马武坝收费站(G5515张南高速出口)'], ['连湖收费站(G5515张南高速出口)'], ['黑溪收费站(G5515张南高速入口)', '黑溪收费站(G5515张南高速出口)'], ['石会收费站(G5515张南高速入口)', '石会收费站(G5515张南高速出口)'], ['夔门收费站(G6911安来高速出口)', '夔门收费站(G6911安来高速入口)', '收费站', '收费站(G6911安来高速入口)', '收费站(G6911安来高速出口)'], ['石堰收费站(G50沪渝高速入口)', '石堰收费站(G50沪渝高速出口)'], ['逆地理编码失败'], ['巴岳收费站(S8铜安高速出口)', '巴岳收费站(S8铜安高速入口)'], ['平滩收费站(S8铜安高速入口)', '平滩收费站(S8铜安高速出口)'], ['小沔收费站(S47渝广高速出口)', '小沔收费站(S47渝广高速入口)'], [], ['城口收费站(G69银百高速出口)', '城口收费站(G69银百高速入口)'], ['大安收费站(G85银昆高速入口东向)', '大安收费站(G85银昆高速出口大安方向)', '大安收费站(G85银昆高速出口大安方向)', '大安收费站(G85银昆高速入口内江方向)', '收费站(永璧高速入口北向)', '收费站(永璧高速出口南向)'], ['隆盛收费站(G7521渝筑高速出口)'], ['永桐收费站(G7521渝筑高速入口)', '永桐收费站(G7521渝筑高速出口)'], ['青年收费站(G7521渝筑高速出口)', '青年收费站(G7521渝筑高速入口)', '青年服务区'], [], ['赶水南收费站(G7521渝筑高速入口北向)', '赶水南收费站(G7521渝筑高速出口赶水南方向)'], ['安稳北收费站(G7521渝筑高速出口)', '安稳北收费站(G7521渝筑高速入口)', '安稳收费站(G75兰海高速出口)', '安稳收费站(G75兰海高速入口)'], ['中峰收费站(S53合璧津高速出口)', '中峰收费站(S53合璧津高速入口)'], ['依凤收费站(S53合璧津高速出口)', '依凤收费站(S53合璧津高速入口)'], ['河边收费站(S53合璧津高速入口)', '河边收费站(S53合璧津高速出口)'], ['G7521巴南收费站(G7521渝筑高速出口)', 'G7521巴南收费站(G7521渝筑高速入口)', '忠兴收费站(G5001重庆绕城高速出口)', '忠兴收费站(G5001重庆绕城高速入口)'], ['接龙北收费站(G7521渝筑高速入口)', '接龙北收费站(G7521渝筑高速出口)'], ['接龙南收费站(G7521渝筑高速出口)', '接龙南收费站(G7521渝筑高速入口)'], ['璧山西收费站(S53合璧津高速出口)', '璧山西收费站(S53合璧津高速入口)'], ['慧谷湖收费站(S0101长涪高速出口)', '慧谷湖收费站(S0101长涪高速入口)'], ['九峰山收费站(G8515广泸高速入口)', '九峰山收费站(G8515广泸高速出口)'], ['三驱收费站(S34大内高速入口)', '三驱收费站(S34大内高速出口)'], ['季家收费站(S34大内高速入口)', '季家收费站(S34大内高速出口)'], ['铜鼓收费站(S34大内高速出口)', '铜鼓收费站(S34大内高速入口)'], [], ['新林收费站(S9合安高速入口)', '新林收费站(S9合安高速出口)'], [], ['收费站(S80三环高速出口东北向)', '收费站(S80三环高速入口西南向)', '收费站(渝武高速复线入口东南向)', '收费站(渝武高速复线出口西向)', '合川南收费站(S80三环高速入口西南向)', '合川南收费站(S80三环高速出口合川南方向)'], ['玉龙收费站(S80三环高速入口)', '玉龙收费站(S80三环高速出口)'], ['天顶收费站(S80三环高速入口)', '天顶收费站(S80三环高速出口)'], ['木耳收费站(S80三环高速出口)', '木耳收费站(S80三环高速入口)'], ['统景收费站(S80三环高速出口)', '统景收费站(S80三环高速入口)'], ['石船收费站(石船互通入口西向)', '石船收费站(石船互通出口东向)'], ['长寿北收费站(S39渝长复线入口)', '长寿北收费站(S39渝长复线出口)'], ['八颗收费站(S39渝长复线出口)', '八颗收费站(S39渝长复线入口)'], ['长寿西收费站(S39渝长复线入口)', '长寿西收费站(S39渝长复线出口)'], ['高桥收费站(S39渝长复线出口)', '高桥收费站(S39渝长复线入口)'], ['五宝收费站(S39渝长复线入口)', '五宝收费站(S39渝长复线出口)', '箭沱湾收费站(G50沪渝高速入口西向)', '箭沱湾收费站(G50沪渝高速出口箭沱湾方向)'], ['石庙收费站(S39渝长复线出口重庆主城方向)', '石庙收费站(S39渝长复线入口东北向)', '复盛收费站(G50沪渝高速入口)', '复盛收费站(G50沪渝高速入口)', '复盛收费站(G50沪渝高速出口)'], ['一品收费站(G75兰海高速出口)', '一品收费站(G75兰海高速入口)'], ['大昌收费站(S11城巫高速入口S11方向)', '大昌收费站(S11城巫高速出口大昌方向)'], ['龙雾收费站(S11城巫高速入口)', '龙雾收费站(S11城巫高速出口)'], ['高峰收费站(G5012恩广高速入口)', '高峰收费站(G5012恩广高速出口)'], ['静观收费站(G85银昆高速出口)', '静观收费站(G85银昆高速入口)'], ['油沙收费站(G5012恩广高速出口)', '油沙收费站(G5012恩广高速入口)'], ['新田港收费站(G5012恩广高速出口)', '新田港收费站(G5012恩广高速入口)'], ['德感收费站(S6渝泸高速入口)', '德感收费站(S6渝泸高速出口)'], ['油溪收费站(永津高速入口西北向)', '油溪收费站(永津高速出口东南向)'], ['石门收费站(S6渝泸高速出口)', '石门收费站(S6渝泸高速入口)'], ['朱杨收费站(S6渝泸高速出口)', '朱杨收费站(S6渝泸高速入口)']]
#list_4 = [i for i in list_3 if len(i) > 0]
#list_5 = [[], [], ['周嘉收费站(G42沪蓉高速出口)', '周嘉收费站(G42沪蓉高速入口)'], [], [], ['田家收费站(G93成渝环线高速入口)', '田家收费站(G93成渝环线高速出口)'], [], ['三教收费站(G8515广泸高速入口)', '三教收费站(G8515广泸高速出口)'], [], [], [], [], [], [], [], [], [], [], ['合川收费站(G75兰海高速出口南充方向)', '合川收费站(G75兰海高速入口东南向)'], [], [], ['晏家收费站(G50沪渝高速入口)', '晏家收费站(G50沪渝高速出口)'], [], ['民国场收费站(G69银百高速出口)', '民国场收费站(G69银百高速入口)'], [], ['大足收费站(G5013渝蓉高速出口)', '大足收费站(G5013渝蓉高速入口)'], [], ['东阳收费站(G75兰海高速入口)', '东阳收费站(G75兰海高速出口)'], ['草街收费站(G75兰海高速出口)', '草街收费站(G75兰海高速入口)'], [], [], [], [], [], ['巫溪收费站(G6911安来高速出口)', '巫溪收费站(G6911安来高速入口)'], [], [], [], ['大庙收费站(G5013渝蓉高速入口)', '大庙收费站(G5013渝蓉高速出口)'], ['马武收费站(G69银百高速入口)', '马武收费站(G69银百高速出口)'], [], [], [], ['长寿收费站(G50沪渝高速出口)', '长寿收费站(G50沪渝高速入口)', '长寿收费站(S0101长涪高速出口长寿方向)'], [], ['大安收费站(G85银昆高速出口大安方向)', '大安收费站(G85银昆高速入口东向)', '大安收费站(G85银昆高速出口大安方向)', '大安收费站(G85银昆高速入口内江方向)'], ['邮亭收费站(G85银昆高速出口)', '邮亭收费站(G85银昆高速入口)'], ['荣昌西收费站(G85银昆高速出口荣昌西方向)', '荣昌西收费站(G85银昆高速入口西向)', '荣昌西收费站(G85银昆高速出口荣昌西方向)'], ['盐井收费站(G75兰海高速入口)', '盐井收费站(G75兰海高速出口)'], ['鸭江收费站(G69银百高速出口)', '鸭江收费站(G69银百高速入口)'], [], [], ['永川收费站(G85银昆高速入口)', '永川收费站(G85银昆高速出口)'], [], ['涪陵东收费站(G69银百高速出口)', '涪陵东收费站(G69银百高速入口)'], [], [], [], ['古佛收费站(G50沪渝高速入口)', '古佛收费站(G50沪渝高速出口)'], ['璧山南收费站(G85银昆高速出口璧山南方向)', '璧山南收费站(G85银昆高速入口西南向)', '璧山南收费站(G85银昆高速入口东向)'], [], [], [], [], [], [], [], ['龙水湖收费站(G8515广泸高速出口)'], [], ['三合收费站(S5九永高速出口)', '三合收费站(S5九永高速入口)'], [], ['潼南收费站(G93成渝环线高速入口)', '潼南收费站(G93成渝环线高速出口)'], [], [], [], [], [], [], ['福禄收费站(G5013渝蓉高速出口)', '福禄收费站(G5013渝蓉高速入口)'], [], ['铜梁东收费站(G93成渝环线高速入口)', '铜梁东收费站(G93成渝环线高速出口)'], [], ['小塆收费站(G93成渝环线高速出口)', '小塆收费站(G93成渝环线高速入口)'], [], [], [], [], [], [], [], [], ['二坪收费站(G8515广泸高速入口)', '二坪收费站(G8515广泸高速出口)'], ['长寿收费站(G50沪渝高速出口)', '长寿收费站(G50沪渝高速入口)', '长寿收费站(S0101长涪高速出口长寿方向)'], [], ['G93高新收费站(G85银昆高速东北向)', 'G93高新收费站(G85银昆高速西南向)'], ['沙子收费站(G50沪渝高速入口)', '沙子收费站(G50沪渝高速出口)'], [], ['广阳收费站(G5001重庆绕城高速入口)', '广阳收费站(G5001重庆绕城高速出口)'], ['北碚南收费站(G75兰海高速出口)', '北碚南收费站(G5001重庆绕城高速出口)'], [], [], [], [], [], [], [], ['双槐收费站(G85银昆高速入口)', '双槐收费站(G85银昆高速出口)'], [], ['复兴收费站(G85银昆高速出口)', '复兴收费站(G85银昆高速入口)'], [], [], ['S7高新南收费站(高盛大道出口)'], ['三界收费站(S5九永高速入口)', '三界收费站(S5九永高速出口)'], [], [], [], [], [], ['万州收费站(G42沪蓉高速东北向)', '万州收费站(G42沪蓉高速西南向)'], ['云台收费站(G50沪渝高速出口)', '云台收费站(G50沪渝高速入口)'], [], ['大歇收费站(G50沪渝高速出口)', '大歇收费站(G50沪渝高速入口)'], ['荣昌东收费站(G85银昆高速入口永川方向)', '荣昌东收费站(G85银昆高速出口荣昌东方向)', '荣昌东收费站(G85银昆高速入口西向)', '荣昌东收费站(G85银昆高速出口荣昌东方向)'], ['水土收费站(G5001重庆绕城高速出口)', '水土收费站(G5001重庆绕城高速入口)'], [], ['忠兴收费站(G5001重庆绕城高速出口)', '忠兴收费站(G5001重庆绕城高速入口)'], [], [], ['铜梁西收费站(G8515广泸高速出口)', '铜梁西收费站(G8515广泸高速入口)'], ['铁山收费站(G5013渝蓉高速出口)', '铁山收费站(G5013渝蓉高速入口)'], [], ['箭沱湾收费站(G50沪渝高速出口箭沱湾方向)', '箭沱湾收费站(G50沪渝高速入口西向)'], [], ['G75巴南收费站(G75兰海高速北向)', 'G75巴南收费站(G75兰海高速南向)', 'G75巴南收费站'], [], [], [], [], ['彭水西收费站(G65包茂高速入口)'], [], [], [], [], [], ['澄溪收费站(G50沪渝高速出口)', '澄溪收费站(G50沪渝高速入口)'], ['荣昌收费站(G85银昆高速入口)', '荣昌收费站(G85银昆高速出口)'], ['阿蓬江收费站(G65包茂高速入口)', '阿蓬江收费站(G65包茂高速出口)'], ['大路收费站(G93成渝环线高速出口)', '大路收费站(G93成渝环线高速入口)'], ['旧县收费站(G8515广泸高速出口)', '旧县收费站(G8515广泸高速入口)'], [], [], ['安富广顺收费站(S55潼荣高速出口)', '安富广顺收费站(S55潼荣高速入口)'], [], ['莲花收费站(S5九永高速入口)', '莲花收费站(S5九永高速出口)'], [], [], [], [], [], [], [], ['珞璜收费站(G5001重庆绕城高速出口)', '珞璜收费站(G5001重庆绕城高速入口)'], [], ['塘坝收费站(S55潼荣高速入口)', '塘坝收费站(S55潼荣高速出口)'], ['卧佛收费站(S55潼荣高速出口)', '卧佛收费站(S55潼荣高速入口)'], [], [], ['双石收费站(G8515广泸高速入口)', '双石收费站(G8515广泸高速出口)', '双石收费站(G8515广泸高速入口)'], [], [], [], ['石柱收费站(G5021石渝高速出口)', '石柱收费站(G50沪渝高速入口)'], ['孙家收费站(G42沪蓉高速出口)', '孙家收费站(G42沪蓉高速入口)'], [], [], [], [], [], [], [], [], [], [], ['璧山北收费站(G93成渝环线高速出口)', '璧山北收费站(G93成渝环线高速入口)'], [], [], [], [], [], ['珞璜收费站(G5001重庆绕城高速出口)', '珞璜收费站(G5001重庆绕城高速入口)'], [], [], ['少云收费站(G93成渝环线高速入口)', '少云收费站(G93成渝环线高速出口)'], [], ['丁家收费站(G85银昆高速入口)', '丁家收费站(G85银昆高速出口)'], [], ['但渡收费站(S0101长涪高速出口但渡方向)'], [], ['黑水收费站(G65包茂高速出口)', '黑水收费站(G65包茂高速入口)'], ['竹溪收费站(G5012恩广高速出口)', '竹溪收费站(G5012恩广高速入口)'], [], [], ['云龙收费站(G42沪蓉高速出口)', '云龙收费站(G42沪蓉高速入口)'], ['璧山收费站(G5013渝蓉高速出口)', '璧山收费站(G5013渝蓉高速入口)'], [], [], ['普乐收费站(G50沪渝高速出口)', '普乐收费站(G50沪渝高速出口)', '普乐收费站(G50沪渝高速入口)'], [], [], [], [], [], [], [], ['大寨收费站(S37南两高速入口)', '大寨收费站(S37南两高速出口)'], [], ['石溪收费站(S37南两高速出口)', '石溪收费站(S37南两高速入口)'], ['施家梁收费站(G5001重庆绕城高速出口)', '施家梁收费站(G5001重庆绕城高速入口)'], [], [], ['蓼子收费站(G69银百高速出口)'], [], [], ['谭家收费站(G69银百高速入口)', '谭家收费站(G69银百高速出口)'], ['温泉收费站(G69银百高速出口)', '温泉收费站(G69银百高速入口)'], ['白鹤收费站(G69银百高速出口)', '白鹤收费站(G69银百高速入口)'], ['开州东收费站(G69银百高速出口)', '开州东收费站(G69银百高速入口)'], [], [], [], ['合兴收费站(G50沪渝高速出口)', '合兴收费站(G50沪渝高速入口)'], [], [], [], [], ['双江潼南西收费站(G93成渝环线高速入口)'], [], [], [], [], ['潼南东收费站(S55潼荣高速入口)', '潼南东收费站(S55潼荣高速出口)'], ['龙岗收费站(S55潼荣高速出口)', '龙岗收费站(S55潼荣高速入口)'], [], ['平桥收费站(G69银百高速出口)', '平桥收费站(G69银百高速入口)'], [], [], [], [], ['拾万收费站(G8515广泸高速入口)', '拾万收费站(G8515广泸高速出口)'], [], [], ['潼南南收费站(S55潼荣高速入口)', '潼南南收费站(S55潼荣高速出口)'], ['石篆山收费站(S55潼荣高速入口)', '石篆山收费站(S55潼荣高速出口)'], [], [], [], [], [], [], [], ['来凤收费站(S5九永高速出口)', '来凤收费站(S5九永高速入口)'], ['陈食收费站(S5九永高速入口)', '陈食收费站(S5九永高速出口)'], [], ['垫江收费站(G42沪蓉高速出口)', '垫江收费站(G42沪蓉高速入口)'], ['李渡收费站(G5021石渝高速入口)', '李渡收费站(G5021石渝高速出口)'], [], [], [], [], ['仁义收费站(S55潼荣高速入口)', '仁义收费站(S55潼荣高速出口)'], [], [], [], [], [], ['白涛收费站(梓白高速入口)', '白涛收费站(梓白高速出口)'], ['来苏收费站(S7永泸高速出口)', '来苏收费站(S7永泸高速入口)'], ['宝峰收费站(S33泸永高速入口)', '宝峰收费站(S7永泸高速出口)'], [], [], [], [], ['走马收费站(G85银昆高速出口)', '走马收费站(G85银昆高速入口)'], [], [], [], [], [], [], [], [], ['龙潭河收费站(G5515张南高速出口)', '龙潭河收费站(G5515张南高速入口)'], [], [], [], [], ['夔门收费站(G6911安来高速出口)', '夔门收费站(G6911安来高速入口)'], [], ['逆地理编码失败'], ['巴岳收费站(S8铜安高速出口)', '巴岳收费站(S8铜安高速入口)'], ['平滩收费站(S8铜安高速入口)', '平滩收费站(S8铜安高速出口)'], ['小沔收费站(S47渝广高速出口)', '小沔收费站(S47渝广高速入口)'], [], [], ['大安收费站(G85银昆高速入口东向)', '大安收费站(G85银昆高速出口大安方向)', '大安收费站(G85银昆高速出口大安方向)', '大安收费站(G85银昆高速入口内江方向)'], ['隆盛收费站(G7521渝筑高速出口)'], ['永桐收费站(G7521渝筑高速入口)', '永桐收费站(G7521渝筑高速出口)'], [], [], [], [], ['中峰收费站(S53合璧津高速出口)', '中峰收费站(S53合璧津高速入口)'], ['依凤收费站(S53合璧津高速出口)', '依凤收费站(S53合璧津高速入口)'], ['河边收费站(S53合璧津高速入口)', '河边收费站(S53合璧津高速出口)'], ['G7521巴南收费站(G7521渝筑高速出口)', 'G7521巴南收费站(G7521渝筑高速入口)'], [], ['接龙南收费站(G7521渝筑高速出口)', '接龙南收费站(G7521渝筑高速入口)'], ['璧山西收费站(S53合璧津高速出口)', '璧山西收费站(S53合璧津高速入口)'], ['慧谷湖收费站(S0101长涪高速出口)', '慧谷湖收费站(S0101长涪高速入口)'], ['九峰山收费站(G8515广泸高速入口)', '九峰山收费站(G8515广泸高速出口)'], [], [], [], [], ['新林收费站(S9合安高速入口)', '新林收费站(S9合安高速出口)'], [], ['收费站(S80三环高速出口东北向)', '收费站(S80三环高速入口西南向)'], ['玉龙收费站(S80三环高速入口)', '玉龙收费站(S80三环高速出口)'], ['天顶收费站(S80三环高速入口)'], ['木耳收费站(S80三环高速出口)', '木耳收费站(S80三环高速入口)'], ['统景收费站(S80三环高速出口)', '统景收费站(S80三环高速入口)'], ['石船收费站(石船互通入口西向)', '石船收费站(石船互通出口东向)'], [], [], [], [], [], [], [], [], [], [], [], [], ['新田港收费站(G5012恩广高速出口)', '新田港收费站(G5012恩广高速入口)'], [], [], [], ['朱杨收费站(S6渝泸高速出口)', '朱杨收费站(S6渝泸高速入口)']]
#list_6 = [i for i in list_5 if len(i) > 0]
#list_7 = [[], [], ['周嘉收费站(G42沪蓉高速出口)', '周嘉收费站(G42沪蓉高速入口)'], [], [], ['田家收费站(G93成渝环线高速入口)', '田家收费站(G93成渝环线高速出口)'], [], [], [], [], [], [], [], [], [], [], [], [], ['合川收费站(G75兰海高速出口南充方向)', '合川收费站(G75兰海高速入口东南向)'], [], [], [], [], ['民国场收费站(G69银百高速出口)', '民国场收费站(G69银百高速入口)'], [], ['大足收费站(G5013渝蓉高速出口)', '大足收费站(G5013渝蓉高速入口)'], [], ['东阳收费站(G75兰海高速入口)', '东阳收费站(G75兰海高速出口)'], ['草街收费站(G75兰海高速出口)', '草街收费站(G75兰海高速入口)'], [], [], [], [], [], [], [], [], [], ['大庙收费站(G5013渝蓉高速入口)', '大庙收费站(G5013渝蓉高速出口)'], ['马武收费站(G69银百高速入口)', '马武收费站(G69银百高速出口)'], [], [], [], [], [], ['大安收费站(G85银昆高速出口大安方向)', '大安收费站(G85银昆高速入口东向)'], ['邮亭收费站(G85银昆高速出口)', '邮亭收费站(G85银昆高速入口)'], ['荣昌西收费站(G85银昆高速出口荣昌西方向)', '荣昌西收费站(G85银昆高速入口西向)'], ['盐井收费站(G75兰海高速入口)', '盐井收费站(G75兰海高速出口)'], ['鸭江收费站(G69银百高速出口)', '鸭江收费站(G69银百高速入口)'], [], [], ['永川收费站(G85银昆高速入口)', '永川收费站(G85银昆高速出口)'], [], [], [], [], [], [], ['璧山南收费站(G85银昆高速出口璧山南方向)', '璧山南收费站(G85银昆高速入口西南向)'], [], [], [], [], [], [], [], [], [], ['三合收费站(S5九永高速出口)', '三合收费站(S5九永高速入口)'], [], [], [], [], [], [], [], [], ['福禄收费站(G5013渝蓉高速出口)', '福禄收费站(G5013渝蓉高速入口)'], [], [], [], ['小塆收费站(G93成渝环线高速出口)', '小塆收费站(G93成渝环线高速入口)'], [], [], [], [], [], [], [], [], [], [], [], ['G93高新收费站(G85银昆高速东北向)', 'G93高新收费站(G85银昆高速西南向)'], ['沙子收费站(G50沪渝高速入口)', '沙子收费站(G50沪渝高速出口)'], [], [], [], [], [], [], [], [], [], [], ['双槐收费站(G85银昆高速入口)', '双槐收费站(G85银昆高速出口)'], [], [], [], [], [], ['三界收费站(S5九永高速入口)', '三界收费站(S5九永高速出口)'], [], [], [], [], [], ['万州收费站(G42沪蓉高速东北向)', '万州收费站(G42沪蓉高速西南向)'], ['云台收费站(G50沪渝高速出口)', '云台收费站(G50沪渝高速入口)'], [], ['大歇收费站(G50沪渝高速出口)', '大歇收费站(G50沪渝高速入口)'], ['荣昌东收费站(G85银昆高速入口永川方向)', '荣昌东收费站(G85银昆高速出口荣昌东方向)', '荣昌东收费站(G85银昆高速入口西向)'], ['水土收费站(G5001重庆绕城高速出口)', '水土收费站(G5001重庆绕城高速入口)'], [], [], [], [], [], ['铁山收费站(G5013渝蓉高速出口)', '铁山收费站(G5013渝蓉高速入口)'], [], [], [], [], [], [], [], [], [], [], [], [], [], [], ['澄溪收费站(G50沪渝高速出口)', '澄溪收费站(G50沪渝高速入口)'], ['荣昌收费站(G85银昆高速入口)', '荣昌收费站(G85银昆高速出口)'], [], [], [], [], [], ['安富广顺收费站(S55潼荣高速出口)', '安富广顺收费站(S55潼荣高速入口)'], [], ['莲花收费站(S5九永高速入口)', '莲花收费站(S5九永高速出口)'], [], [], [], [], [], [], [], [], [], [], ['卧佛收费站(S55潼荣高速出口)', '卧佛收费站(S55潼荣高速入口)'], [], [], [], [], [], [], ['石柱收费站(G5021石渝高速出口)', '石柱收费站(G50沪渝高速入口)'], ['孙家收费站(G42沪蓉高速出口)', '孙家收费站(G42沪蓉高速入口)'], [], [], [], [], [], [], [], [], [], [], [], [], [], [], [], [], [], [], [], [], [], ['丁家收费站(G85银昆高速入口)', '丁家收费站(G85银昆高速出口)'], [], [], [], ['黑水收费站(G65包茂高速出口)', '黑水收费站(G65包茂高速入口)'], ['竹溪收费站(G5012恩广高速出口)', '竹溪收费站(G5012恩广高速入口)'], [], [], [], ['璧山收费站(G5013渝蓉高速出口)', '璧山收费站(G5013渝蓉高速入口)'], [], [], ['普乐收费站(G50沪渝高速出口)'], [], [], [], [], [], [], [], [], [], [], [], [], [], ['蓼子收费站(G69银百高速出口)'], [], [], [], [], [], [], [], [], [], ['合兴收费站(G50沪渝高速出口)', '合兴收费站(G50沪渝高速入口)'], [], [], [], [], ['双江潼南西收费站(G93成渝环线高速入口)'], [], [], [], [], ['潼南东收费站(S55潼荣高速入口)', '潼南东收费站(S55潼荣高速出口)'], ['龙岗收费站(S55潼荣高速出口)', '龙岗收费站(S55潼荣高速入口)'], [], ['平桥收费站(G69银百高速出口)', '平桥收费站(G69银百高速入口)'], [], [], [], [], [], [], [], ['潼南南收费站(S55潼荣高速入口)', '潼南南收费站(S55潼荣高速出口)'], ['石篆山收费站(S55潼荣高速入口)', '石篆山收费站(S55潼荣高速出口)'], [], [], [], [], [], [], [], ['来凤收费站(S5九永高速出口)', '来凤收费站(S5九永高速入口)'], ['陈食收费站(S5九永高速入口)', '陈食收费站(S5九永高速出口)'], [], ['垫江收费站(G42沪蓉高速出口)', '垫江收费站(G42沪蓉高速入口)'], ['李渡收费站(G5021石渝高速入口)', '李渡收费站(G5021石渝高速出口)'], [], [], [], [], ['仁义收费站(S55潼荣高速入口)', '仁义收费站(S55潼荣高速出口)'], [], [], [], [], [], [], ['来苏收费站(S7永泸高速出口)', '来苏收费站(S7永泸高速入口)'], ['宝峰收费站(S33泸永高速入口)', '宝峰收费站(S7永泸高速出口)'], [], [], [], [], ['走马收费站(G85银昆高速出口)', '走马收费站(G85银昆高速入口)'], [], [], [], [], [], [], [], [], ['龙潭河收费站(G5515张南高速出口)', '龙潭河收费站(G5515张南高速入口)'], [], [], [], [], ['夔门收费站(G6911安来高速出口)', '夔门收费站(G6911安来高速入口)'], [], ['逆地理编码失败'], [], [], [], [], [], ['大安收费站(G85银昆高速入口东向)', '大安收费站(G85银昆高速出口大安方向)'], ['隆盛收费站(G7521渝筑高速出口)'], ['永桐收费站(G7521渝筑高速入口)', '永桐收费站(G7521渝筑高速出口)'], [], [], [], [], ['中峰收费站(S53合璧津高速出口)', '中峰收费站(S53合璧津高速入口)'], [], ['河边收费站(S53合璧津高速入口)', '河边收费站(S53合璧津高速出口)'], [], [], ['接龙南收费站(G7521渝筑高速出口)', '接龙南收费站(G7521渝筑高速入口)'], ['璧山西收费站(S53合璧津高速出口)'], ['慧谷湖收费站(S0101长涪高速出口)', '慧谷湖收费站(S0101长涪高速入口)'], [], [], [], [], [], ['新林收费站(S9合安高速入口)', '新林收费站(S9合安高速出口)'], [], [], ['玉龙收费站(S80三环高速入口)', '玉龙收费站(S80三环高速出口)'], [], [], ['统景收费站(S80三环高速出口)', '统景收费站(S80三环高速入口)'], ['石船收费站(石船互通入口西向)', '石船收费站(石船互通出口东向)'], [], [], [], [], [], [], [], [], [], [], [], [], ['新田港收费站(G5012恩广高速出口)', '新田港收费站(G5012恩广高速入口)'], [], [], [], []]
#list_8 = [i for i in list_7 if len(i) > 0]
#print(len(list))
#print(len(list_4))
#print(len(list_2))
#print(len(list_6))
#print(len(list_8))
#list_a = [i for i in a if len(i) > 0]
#print(len(list_a))
